cmsis-svd/cmsis-svd/data/Freescale/MKV44F16.svd
        <register>
          <name>CLIST4</name>
          <description>ADC Channel List Register 4</description>
          <addressOffset>0xE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFEDC</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SAMPLE12</name>
              <description>Sample Field 12</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLE13</name>
              <description>Sample Field 13</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLE14</name>
              <description>Sample Field 14</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLE15</name>
              <description>Sample Field 15</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0000</name>
                  <description>Single Ended: ADCA_CH0, Differential: ADCA_CH0+, ADCA_CH1-</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0001</name>
                  <description>Single Ended: ADCA_CH1, Differential: ADCA_CH0+, ADCA_CH1-</description>
                  <value>#0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0010</name>
                  <description>Single Ended: ADCA_CH2, Differential: ADCA_CH2+, ADCA_CH3-</description>
                  <value>#0010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0011</name>
                  <description>Single Ended: ADCA_CH3, Differential: ADCA_CH2+, ADCA_CH3-</description>
                  <value>#0011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0100</name>
                  <description>Single Ended: ADCA_CH4, Differential: ADCA_CH4+, ADCA_CH5-</description>
                  <value>#0100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0101</name>
                  <description>Single Ended: ADCA_CH5, Differential: ADCA_CH4+, ADCA_CH5-</description>
                  <value>#0101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0110</name>
                  <description>Single Ended: ADCA_CH6, Differential: ADCA_CH6+, ADCA_CH7-</description>
                  <value>#0110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0111</name>
                  <description>Single Ended: ADCA_CH7, Differential: ADCA_CH6+, ADCA_CH7-</description>
                  <value>#0111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1000</name>
                  <description>Single Ended: ADCB_CH0, Differential: ADCB_CH0+, ADCB_CH1-</description>
                  <value>#1000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1001</name>
                  <description>Single Ended: ADCB_CH1, Differential: ADCB_CH0+, ADCB_CH1-</description>
                  <value>#1001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1010</name>
                  <description>Single Ended: ADCB_CH2, Differential: ADCB_CH2+, ADCB_CH3-</description>
                  <value>#1010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1011</name>
                  <description>Single Ended: ADCB_CH3, Differential: ADCB_CH2+, ADCB_CH3-</description>
                  <value>#1011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1100</name>
                  <description>Single Ended: ADCB_CH4, Differential: ADCB_CH4+, ADCB_CH5-</description>
                  <value>#1100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1101</name>
                  <description>Single Ended: ADCB_CH5, Differential: ADCB_CH4+, ADCB_CH5-</description>
                  <value>#1101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1110</name>
                  <description>Single Ended: ADCB_CH6, Differential: ADCB_CH6+, ADCB_CH7-</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1111</name>
                  <description>Single Ended: ADCB_CH7, Differential: ADCB_CH6+, ADCB_CH7-</description>
                  <value>#1111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIS</name>
          <description>ADC Sample Disable Register</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xF0F0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DS</name>
              <description>Disable Sample Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>SAMPLEx channel is enabled for ADC scan.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>SAMPLEx channel is disabled for ADC scan and corresponding channels after SAMPLEx also doesn not occur in an ADC scan.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
